app/Models/Metudiant.php

SELECT *
FROM `etudiant`
WHERE `mail` = 'ayoub.fathallah@eoles-epsi.net'
OR `login` = 'ayoub.fathallah@eoles-epsi.net'
 LIMIT 1
---
    public function loginPersonne($dataLogin)
    {
        // Récupération du nom d'utilisateur ou de l'email
        $login = $dataLogin['login'];

        // Vérification si l'utilisateur existe
        $user = $this->where('mail', $login)->orWhere('login', $login)->first();